data/DUCT/AR_3_Ret_360/constant/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "constant";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
8748
(
(0.0005 4.572056072e-05 4.662161789e-05)
(0.0005 0.0001330052675 4.662161789e-05)
(0.0005 0.000212355001 4.662161789e-05)
(0.0005 0.0002844911224 4.662161789e-05)
(0.0005 0.0003500694144 4.662161788e-05)
(0.0005 0.0004096860436 4.662161788e-05)
(0.0005 0.0004638829793 4.662161789e-05)
(0.0005 0.0005131529208 4.662161789e-05)
...
)
;

boundaryField
{
    inflow
    {
        type            cyclic;
    }
    outflow
    {
        type            cyclic;
    }
    wallTop
    {
        type            calculated;
        value           nonuniform List<vector> 
162
(
(0.0005 0.001 4.662161789e-05)
(0.0005 0.001 0.0001384247911)
(0.0005 0.001 0.0002273923203)
(0.0005 0.001 0.0003136117937)
(0.0005 0.001 0.0003971680942)
(0.0005 0.001 0.0004781434825)
(0.0005 0.001 0.0005566176787)
(0.0005 0.001 0.0006326679403)
...
)
;
    }
    wallSide
    {
        type            calculated;
        value           nonuniform List<vector> 
54
(
(0.0005 4.572056072e-05 0.003)
(0.0005 0.0001330052675 0.003)
(0.0005 0.000212355001 0.003)
(0.0005 0.0002844911224 0.003)
(0.0005 0.0003500694144 0.003)
(0.0005 0.0004096860436 0.003)
(0.0005 0.0004638829793 0.003)
(0.0005 0.0005131529208 0.003)
...
)
;
    }
    symmetryBottom
    {
        type            symmetry;
    }
    symmetrySide
    {
        type            symmetry;
    }
}


// ************************************************************************* //
