data/DUCT/AR_3_Ret_360/constant/Cz
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "constant";
    object      Cz;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
8748
(
4.662161789e-05
4.662161789e-05
4.662161789e-05
4.662161789e-05
4.662161788e-05
4.662161788e-05
4.662161789e-05
4.662161789e-05
...
)
;

boundaryField
{
    inflow
    {
        type            cyclic;
    }
    outflow
    {
        type            cyclic;
    }
    wallTop
    {
        type            calculated;
        value           nonuniform List<scalar> 
162
(
4.662161789e-05
0.0001384247911
0.0002273923203
0.0003136117937
0.0003971680942
0.0004781434825
0.0005566176787
0.0006326679403
...
)
;
    }
    wallSide
    {
        type            calculated;
        value           nonuniform List<scalar> 
54
(
0.003
0.003
0.003
0.003
0.003
0.003
0.003
0.003
...
)
;
    }
    symmetryBottom
    {
        type            symmetry;
    }
    symmetrySide
    {
        type            symmetry;
    }
}


// ************************************************************************* //
