data/DUCT/AR_3_Ret_360/constant/V
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "constant";
    object      V;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
8748
(
8.526266045e-12
7.751150946e-12
7.046500869e-12
6.405909872e-12
5.823554431e-12
5.294140393e-12
4.812854905e-12
4.375322639e-12
...
)
;

boundaryField
{
    inflow
    {
        type            cyclic;
    }
    outflow
    {
        type            cyclic;
    }
    wallTop
    {
        type            calculated;
        value           uniform 0;
    }
    wallSide
    {
        type            calculated;
        value           uniform 0;
    }
    symmetryBottom
    {
        type            symmetry;
    }
    symmetrySide
    {
        type            symmetry;
    }
}


// ************************************************************************* //
