data/DUCT/AR_3_Ret_360/0/tauij_LES
tauij_LES nonuniform List<symmTensor>
8748
(
(19.814687414630185 1.3709568112636803 0.13097176251272002 12.602054311556012 0.004649931134685605 12.249635164050813)
(22.636663132644323 3.9514177362385885 0.15579313423970748 13.13262021392442 -0.010187345237181771 13.458629923016712)
(27.045539903351305 6.221386029876569 0.17714358118032889 14.072404490509118 -0.012399031310532275 15.475708459559113)
(32.09656550833146 8.248626748089292 0.16092221625351807 15.277402289927485 -0.010058317423905545 17.91365293051511)
(37.14966189640362 10.074876154926269 0.153582792744583 16.62393965375169 -0.0029847847882653613 20.56892603047646)
(41.82196023373597 11.730708354240589 0.1484373996898904 18.03103764734614 -0.0023970852712912167 23.22496099838494)
(46.205535557449146 13.21872651065921 0.15901703071500659 19.427305037847116 -0.016101823557723452 25.794931020802466)
(50.35953952941021 14.553468793023866 0.15118676547370455 20.78612465624096 -0.024577873684867656 28.25376362998309)
...
);
